# 1.Pandas数据结构

### 1) Series的创建

#### 两种创建方式
###### （1）由列表或numpy创建
######          默认索引为0到n-1的整数型索引

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
import matplotlib.pyplot as plt

In [2]:
n1 = np.array([2,4,5,6,3])
n1 [2]

5

In [4]:
s = Series (n1)
s

0    2
1    4
2    5
3    6
4    3
dtype: int64

In [7]:
s.index = list('abcde')
s

a    2
b    4
c    5
d    6
e    3
dtype: int64

In [10]:
s = Series(n1,index=['wr','tt','hkb','lwl','lyq'])
s

wr     2
tt     4
hkb    5
lwl    6
lyq    3
dtype: int64

In [17]:
s = Series(np.random.randint(0,10),index=list('abcde'))
s

a    8
b    8
c    8
d    8
e    8
dtype: int64

###### （2） 由字典创建

In [20]:
s2 = Series({'a':1,'b':2,'c':4,'d':8})
s2

a    1
b    2
c    4
d    8
dtype: int64

### 2) Series的索引和切片

#### 可以使用中括号取单个索引（此时返回的是元素类型），或者中括号里的一个列表取多个索引（此时返回的仍然是一个series类型）。分为显示索引和隐式索引：
##### （1） 显示索引：
        #### - 使用index中的元素作为索引值
        #### - 使用.loc[](推荐）
        #### 注意，此时是闭区间

In [23]:
s = Series(np.random.random(10),index=list('abcdefghij'))
s

a    0.298623
b    0.794823
c    0.869091
d    0.706409
e    0.499180
f    0.563259
g    0.473630
h    0.839732
i    0.671273
j    0.993537
dtype: float64

In [27]:
s['a']

0.2986228332228088

In [25]:
s.loc['c']

0.8690908530851342

In [31]:
##进行切片
s[0:5]
s['a':'d']

a    0.298623
b    0.794823
c    0.869091
d    0.706409
dtype: float64

##### (2) 隐式索引：
    ##### -使用整数作为索引值
    ##### -使用.iloc[]推荐

In [28]:
s.iloc[0]

0.2986228332228088

### 3) Series的基本概念
##### 可以吧Series看成一个定长的有序字典
##### 可以通过shape, size, index, values等得到series的属性

In [32]:
display(s.shape,s.size,s.index,s.values)

(10,)

10

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

array([0.29862283, 0.79482333, 0.86909085, 0.70640908, 0.49917998,
       0.5632589 , 0.47362987, 0.83973179, 0.6712731 , 0.99353725])

In [37]:
## df==DataFrame
df = pd.read_csv('templete.csv')
df

,RT(milliseconds),RT(minutes) - NOT USED BY IMPORT,RI,77,78,79,80,81,82,83,...,479,480,481,482,483,484,485,486,487,488
0,240077,3.00390,0,2998,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,240437,3.01172,0,2840,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,240781,3.01953,0,2842,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,241140,3.02735,0,2843,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,241500,3.03490,0,2909,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2734,1169859,20.49900,0,264,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2735,1170203,20.50500,0,228,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2736,1170562,20.51000,0,235,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2737,1170906,20.51600,0,145,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2738,1171265,20.52200,0,274,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [36]:
type(df)

pandas.core.frame.DataFrame

In [41]:
lastl=df['488']
lastl
type(lastl)

pandas.core.series.Series

In [43]:
lastl.head()

0    0
1    0
2    0
3    0
4    0
Name: 488, dtype: int64

In [44]:
lastl.tail()

2734    0
2735    0
2736    0
2737    0
2738    0
Name: 488, dtype: int64

In [46]:
s = Series([1,24,None,np.nan],index = list('风火雷电'))
s

风     1.0
火    24.0
雷     NaN
电     NaN
dtype: float64

In [49]:
s.sum()

25.0

In [47]:
None == np.nan

False

In [48]:
display(type(None),type(np.nan))

NoneType

float

### 4) Series的运算
###### （1） 适用于numpy的数组运算也适用于Series

In [50]:
s+10

风    11.0
火    34.0
雷     NaN
电     NaN
dtype: float64

In [52]:
#在进行算数运算时，如果包含NaN，那么fill_value默认将Nan设置为=后面的值
s.add(10,fill_value=0)

风    11.0
火    34.0
雷    10.0
电    10.0
dtype: float64

### (2) Series之间的运算

#### ·在运算中自动对齐不同索引的数据
#### ·如果索引不对应，则补NaN

In [53]:
s1 = Series([2,4,7,9], index = [0,1,2,3])
s2 = Series ([1,2,3,4], index = [2,3,4,5])

In [54]:
# Series索引值，进行相加时，就是索引相同进行相加
s1+s2

0     NaN
1     NaN
2     8.0
3    11.0
4     NaN
5     NaN
dtype: float64

##### ·注意：想要保留所有index，则需要使用.add()函数

In [57]:
s1.add(s2,fill_value=0)

0     2.0
1     4.0
2     8.0
3    11.0
4     3.0
5     4.0
dtype: float64

In [59]:
s = Series ([1,2,None])
nd = np.array([1,2,None])

In [60]:
nd.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [61]:
s.sum()

3.0

##### ndarray中如果有nan，没有办法进行操作

# 2. DataFrame
##### Data Frame是一个表格形式的数据结构，可以看作是由Series组成的字典（共用同一个索引）。DataFrame由按一定顺序排列的多列数据组成。设计初衷是将Series的使用场景从一维拓展到多维。DataFrame既有行索引，也有列索引。
###### ·行索引： index
###### ·列索引： Columns
###### ·values（numpy的二维数组）

In [62]:
df

,RT(milliseconds),RT(minutes) - NOT USED BY IMPORT,RI,77,78,79,80,81,82,83,...,479,480,481,482,483,484,485,486,487,488
0,240077,3.00390,0,2998,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,240437,3.01172,0,2840,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,240781,3.01953,0,2842,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,241140,3.02735,0,2843,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,241500,3.03490,0,2909,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2734,1169859,20.49900,0,264,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2735,1170203,20.50500,0,228,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2736,1170562,20.51000,0,235,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2737,1170906,20.51600,0,145,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2738,1171265,20.52200,0,274,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [64]:
display (df.index,df.columns,df.values, df.values.shape)

RangeIndex(start=0, stop=2739, step=1)

Index(['RT(milliseconds)', 'RT(minutes) - NOT USED BY IMPORT', 'RI', '77',
       '78', '79', '80', '81', '82', '83',
       ...
       '479', '480', '481', '482', '483', '484', '485', '486', '487', '488'],
      dtype='object', length=415)

array([[2.400770e+05, 3.003900e+00, 0.000000e+00, ..., 0.000000e+00,
        0.000000e+00, 0.000000e+00],
       [2.404370e+05, 3.011720e+00, 0.000000e+00, ..., 0.000000e+00,
        0.000000e+00, 0.000000e+00],
       [2.407810e+05, 3.019530e+00, 0.000000e+00, ..., 0.000000e+00,
        0.000000e+00, 0.000000e+00],
       ...,
       [1.170562e+06, 2.051000e+01, 0.000000e+00, ..., 0.000000e+00,
        0.000000e+00, 0.000000e+00],
       [1.170906e+06, 2.051600e+01, 0.000000e+00, ..., 0.000000e+00,
        0.000000e+00, 0.000000e+00],
       [1.171265e+06, 2.052200e+01, 0.000000e+00, ..., 0.000000e+00,
        0.000000e+00, 0.000000e+00]])

(2739, 415)

### 1) DataFrame的创建
##### 最常用的方法是传递一个字典来创建。DataFrame以字典的键作为每一列的名称，以字典的值（一个数组）作为每一列。此外，DataFrame会自动加上一行的索引（和Series一样）
##### 同Series一样，若传入的列与字典的键不匹配，则相应的值为Nan

In [73]:
# 创建Series时候，给Series二维数据，Series的数据只能是1-dimensional data
df = DataFrame({'height':[145,136,135,167],
                'age':np.random.randint(18,25,size=4),
                'sex':['male','female','male','female'],'weight':[43,44,32,55]},index = list('ABCD'),
              columns=['Height','age','sex','weight'])
df

  Height  age     sex  weight
A    NaN   22    male      43
B    NaN   22  female      44
C    NaN   21    male      32
D    NaN   22  female      55

### 2) DataFrame的索引
##### （1）对列进行索引
###### ·通过类似字典的方式
###### ·通过属性的方式
###### 可以将DataFrame的列获取一个Series。返回的Series拥有原DataFrame相同的索引，而且Name属性也已经设置好了，就是相应的列名。

In [76]:
df = DataFrame({'height':[145,136,135,167],
                'age':np.random.randint(18,25,size=4),
                'sex':['male','female','male','female'],'weight':[43,44,32,55]},index = list('ABCD'),
              columns=['height','age','sex','weight'])
df

   height  age     sex  weight
A     145   24    male      43
B     136   21  female      44
C     135   22    male      32
D     167   22  female      55

In [80]:
#检索列返回值，是Series
age=df['age']
display(type(age),age)

pandas.core.series.Series

A    24
B    21
C    22
D    22
Name: age, dtype: int64

In [82]:
#对于DataFrame,列名，相当于属性；
#DataFrame是统计数据时，用的表格，某一个事物的属性，每一个属性对应DataFrame中的列名。
df.age

A    24
B    21
C    22
D    22
Name: age, dtype: int64

#### (2) 对行进行索引
##### ·使用.ix[]来进行索引
##### ·使用.loc[]加index进行索引
##### ·使用iloc[]加整数进行索引

###### ·同样返回一个Series，index为原来的columns

In [86]:
df.loc[['A','B']]
#对于行的检索，返回值也是Series
# ！！！['A','B']，如果检索多行返回的数据，是DataFrame

   height  age     sex  weight
A     145   24    male      43
B     136   21  female      44

In [87]:
df.loc['A':'C']

   height  age     sex  weight
A     145   24    male      43
B     136   21  female      44
C     135   22    male      32

In [89]:
#对于切片而言，没有切片
#列是属性，
df['Height':'Age']

Empty DataFrame
Columns: [height, age, sex, weight]
Index: []

#####  (3) 对元素进行索引的方法
######  -使用列索引
###### - 使用行索引（iloc[3,1]相当于两个参数；iloc[[3,3]]里面的[3,3]看作一个参数）
###### -使用values属性（二维numpy数组）

In [90]:
df

   height  age     sex  weight
A     145   24    male      43
B     136   21  female      44
C     135   22    male      32
D     167   22  female      55

In [93]:
df['sex']['B']='女博士'

<ipython-input-93-d76bce6d7ea8>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['sex']['B']='女博士'

In [94]:
df

   height  age     sex  weight
A     145   24    male      43
B     136   21     女博士      44
C     135   22    male      32
D     167   22  female      55

In [95]:
df.loc['C']['height']

135

In [97]:
#检索行的时候，参数可以多个，但是列就不行。

df.loc['C','height']

135

In [98]:
df.values[0,2]

'male'

#### 注意：直接用中括号时：
##### -索引表示的是列索引
##### -切片表示的是行切片

### 3） DataFrame 的运算
##### （1）DataFrame之间的运算
#### 同Series一样：
##### -在运算中自动对齐不同索引的数据
#### -如果索引不对应，则不Nan

#### 创建DataFrame df1 不同人员的各科目成绩，月考一

In [105]:
df1 = DataFrame(np.random.randint(0,150,size=(4,4)),index=['张三','李四','王五','老刘'],
               columns = ['语文','数学','外语','python'])
df1

    语文   数学   外语  python
张三  25  148   38     128
李四  33   61   47      32
王五  44   26   88      61
老刘  34  112  148     131

In [124]:
df2=DataFrame(np.random.randint(0,150,size =(5,4)), index=['张三','李四','王五','老刘','小张'],
               columns = ['语文','数学','外语','python'])
df2

     语文   数学   外语  python
张三   21   80   39       2
李四  137  103   99       5
王五    4   17  126      59
老刘   68   16  103      24
小张   68  113  114      35

In [125]:
df1+df2

       语文     数学     外语  python
小张    NaN    NaN    NaN     NaN
张三   46.0  228.0   77.0   130.0
李四  170.0  164.0  146.0    37.0
王五   48.0   43.0  214.0   120.0
老刘  102.0  128.0  251.0   155.0

In [128]:
df3=df1.add(df2,fill_value=0)
df3

       语文     数学     外语  python
小张   68.0  113.0  114.0    35.0
张三   46.0  228.0   77.0   130.0
李四  170.0  164.0  146.0    37.0
王五   48.0   43.0  214.0   120.0
老刘  102.0  128.0  251.0   155.0

In [129]:
df3['语文'].loc['小张']

68.0

#### （2）Series与DataFrame之间的运算
##### 重要：
###### -使用python操作符：以行为单位操作（参数必须是行），对所有行都有效。（类似于numpy中二维数组与一维数组的运算，但可能出现NaN）
###### -使用pandas操作函数：
     axis=0:以列为单位操作（参数必须是列），对所有列都有效。
     axis=1:以行为单位操作（参数必须是行），对所有行都有效。

In [133]:
s1 = df3['python']
s1

小张     35.0
张三    130.0
李四     37.0
王五    120.0
老刘    155.0
Name: python, dtype: float64

In [136]:
s2=df3.loc['小张']
s2

语文         68.0
数学        113.0
外语        114.0
python     35.0
Name: 小张, dtype: float64

In [139]:
ss = df3.loc['张三']

In [143]:
s3=df3.add(ss,axis='index')
s3

        语文  数学  外语  python
python NaN NaN NaN     NaN
外语     NaN NaN NaN     NaN
小张     NaN NaN NaN     NaN
张三     NaN NaN NaN     NaN
数学     NaN NaN NaN     NaN
李四     NaN NaN NaN     NaN
王五     NaN NaN NaN     NaN
老刘     NaN NaN NaN     NaN
语文     NaN NaN NaN     NaN

In [145]:
df1 = DataFrame (np.random.randint(0,150,size=16).reshape(4,4),
                 columns = ['Chinese','English','Math','Pathon'],index = list('abcd'))
df1

   Chinese  English  Math  Pathon
a      108      109   108      88
b       49      113    74       2
c       62       84    75     113
d       76        9    73      10

In [146]:
df2 = DataFrame (np.random.randint(0,150,size=16).reshape(4,4),
                 columns = ['Chinese','English','Math','Pathon'],index = list('abcd'))
df2

   Chinese  English  Math  Pathon
a       52       37    39     122
b      140       80   115     140
c       69      106    52      33
d      122       82   108     112

In [148]:
df3=(df1+df2)/2
df3

   Chinese  English  Math  Pathon
a     80.0     73.0  73.5   105.0
b     94.5     96.5  94.5    71.0
c     65.5     95.0  63.5    73.0
d     99.0     45.5  90.5    61.0

In [149]:
df1.add(df2,fill_value=0)

   Chinese  English  Math  Pathon
a      160      146   147     210
b      189      193   189     142
c      131      190   127     146
d      198       91   181     122

In [151]:
df1['Math']['B']=0
df1

   Chinese  English  Math  Pathon
a      108      109   108      88
b       49      113    74       2
c       62       84    75     113
d       76        9    73      10

In [153]:
df1.loc['c']+=100
df1

   Chinese  English  Math  Pathon
a      108      109   108      88
b       49      113    74       2
c      162      184   175     213
d       76        9    73      10

In [154]:
df1+10

   Chinese  English  Math  Pathon
a      118      119   118      98
b       59      123    84      12
c      172      194   185     223
d       86       19    83      20